erp3l/src/Catalogs/КатегорииСобытийОповещений/КатегорииСобытийОповещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииСобытийОповещений</name>
  <predefined>
    <items>
      <name>Напоминания</name>
      <description>Напоминания</description>
    </items>
    <items>
      <name>Ошибки</name>
      <description>Оповещения для администратора инф. базы</description>
    </items>
    <items>
      <name>ОповещенияЭтапаПроцесса</name>
      <description>Оповещения этапов процесса</description>
    </items>
    <items>
      <name>ОценкаАльтернатив</name>
      <description>Оценка альтернатив</description>
    </items>
    <items>
      <name>ПотребностьВРесурсахЗакупок</name>
      <description>Потребность в ресурсах закупок</description>
    </items>
    <items>
      <name>СобытияВыполненияПроцесса</name>
      <description>Процесс - общие события процессов</description>
    </items>
    <items>
      <name>СобытияСогласования</name>
      <description>Процесс - события согласования</description>
    </items>
    <items>
      <name>СобытияЭтапаОбработка</name>
      <description>Процесс - этап &quot;Обработка&quot;</description>
    </items>
    <items>
      <name>СобытияЭтапаРучнойПереход</name>
      <description>Процесс - этап &quot;Переход по выбору&quot;</description>
    </items>
    <items>
      <name>СобытияПроцессаПодготовкиОтчетности</name>
      <description>Процесс - этап &quot;Подготовка отчетности&quot;</description>
    </items>
    <items>
      <name>СобытияГПЗ</name>
      <description>События годовой программы закупок</description>
    </items>
    <items>
      <name>СобытияМонитораКлючевыхПоказателей</name>
      <description>События монитора ключевых показателей</description>
    </items>
    <items>
      <name>АккредитацияПоставщиков</name>
      <description>События по аккредитации поставщиков</description>
    </items>
    <items>
      <name>СобытияДоговоров</name>
      <description>События по договорам</description>
    </items>
    <items>
      <name>ОплатаЗаявок</name>
      <description>События по заявкам на оплату</description>
    </items>
    <items>
      <name>СобытияПоКорректировкамЛимитов</name>
      <description>События по корректировкам лимитов</description>
    </items>
    <items>
      <name>СобытияПоМероприятиям</name>
      <description>События по мероприятиям</description>
    </items>
    <items>
      <name>СобытияПроектов</name>
      <description>События по проектам</description>
    </items>
  </predefined>
  <attributes>
    <name>ОповещаемыеПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСкрытаяКатегория</name>
    <comment>Не отображается пользователям</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

erp3l/src/Catalogs/КатегорииСобытийОповещений/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ОповещаемыеПоУмолчанию) Тогда
		Если Ссылка = Справочники.КатегорииСобытийОповещений.СобытияВыполненияПроцесса Тогда
			ОповещаемыеПоУмолчанию = НСтр("ru = 'Администратор шаблона процесса'");
		ИначеЕсли  Ссылка = Справочники.КатегорииСобытийОповещений.СобытияСогласования   Тогда	
			ОповещаемыеПоУмолчанию = НСтр("ru = 'Ответственный за объект согласования'");
		ИначеЕсли  Ссылка = Справочники.КатегорииСобытийОповещений.СобытияДоговоров   Тогда	
			ОповещаемыеПоУмолчанию = НСтр("ru = 'Значение реквизита 'Ответственный''");
		ИначеЕсли  Ссылка = Справочники.КатегорииСобытийОповещений.СобытияПроектов   Тогда	
			ОповещаемыеПоУмолчанию = НСтр("ru = 'Значение реквизита 'Ответственный пользователь''");
		ИначеЕсли  Ссылка = Справочники.КатегорииСобытийОповещений.ОплатаЗаявок   Тогда	
			ОповещаемыеПоУмолчанию = НСтр("ru = 'Инициатор заявки'");	
		ИначеЕсли  Ссылка = Справочники.КатегорииСобытийОповещений.СобытияПроцессаПодготовкиОтчетности   Тогда	
			ОповещаемыеПоУмолчанию = НСтр("ru = 'Исполнители по документам, Ответственные за этапы'");	
		ИначеЕсли  Ссылка = Справочники.КатегорииСобытийОповещений.Напоминания Тогда	
			ОповещаемыеПоУмолчанию = НСтр("ru = 'Получатели напоминания'");	
		ИначеЕсли  Ссылка = Справочники.КатегорииСобытийОповещений.Ошибки Тогда	
			ОповещаемыеПоУмолчанию = НСтр("ru = 'Ответственный сотрудник'");	
		ИначеЕсли  Ссылка = Справочники.КатегорииСобытийОповещений.СобытияЭтапаОбработка Тогда	
			ОповещаемыеПоУмолчанию = НСтр("ru = 'Выполняющий задачу'");	
		ИначеЕсли  Ссылка = Справочники.КатегорииСобытийОповещений.СобытияЭтапаРучнойПереход Тогда	
			ОповещаемыеПоУмолчанию = НСтр("ru = 'Ответственный сотрудник'");	
		ИначеЕсли  Ссылка = Справочники.КатегорииСобытийОповещений.СобытияПоМероприятиям Тогда	
			ОповещаемыеПоУмолчанию = НСтр("ru = 'Ответственный сотрудник'");				
		ИначеЕсли  Ссылка = Справочники.КатегорииСобытийОповещений.СобытияМонитораКлючевыхПоказателей Тогда	
			ОповещаемыеПоУмолчанию = НСтр("ru = 'Ответственный сотрудник'");	
		ИначеЕсли  Ссылка = Справочники.КатегорииСобытийОповещений.СобытияПоКорректировкамЛимитов Тогда	
			ОповещаемыеПоУмолчанию = НСтр("ru = 'Ответственный сотрудник'");				
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры
